#Fibonachi Numbers

num = 10 # змінна кількості чисел які будемо генерувати

num1 = 0 # значення першого числа
num2 = 1 # значення другого числа

every_next_num = num2 # змінна яка присвоює кожному наступному числу значення 2го 
count = 1 # підрахунок ,який буде збільшуватись на 1 на кожній ітерації до заданої поппередньо кількості num = 10

while count <= num: #Цикл while який не завершиться поки вхідна кількість не будет більшою чи рівною "сount"
    print(every_next_num, end=" ") # прінтимо кожне наступне числа ,яке = num2 
    count += 1 # та збільшуємо лічильник 
    num1,num2 = num2,every_next_num # заміщення num 1 на num2 , а num2 на every_next_num
    every_next_num = num1 + num2 #а every_next_num - це сума попередніх двух
print()